; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-8nodes-1000size-3degree-100mindistance-3trucks-2packages-795seed

(define (problem transport-two-cities-sequential-8nodes-1000size-3degree-100mindistance-3trucks-2packages-795seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-1-loc-7 - location
  city-2-loc-7 - location
  city-1-loc-8 - location
  city-2-loc-8 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 129,742 -> 23,434
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 33)
  ; 23,434 -> 129,742
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 33)
  ; 73,81 -> 23,434
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 36)
  ; 23,434 -> 73,81
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 36)
  ; 376,935 -> 129,742
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 32)
  ; 129,742 -> 376,935
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 32)
  ; 202,280 -> 23,434
  (road city-1-loc-7 city-1-loc-1)
  (= (road-length city-1-loc-7 city-1-loc-1) 24)
  ; 23,434 -> 202,280
  (road city-1-loc-1 city-1-loc-7)
  (= (road-length city-1-loc-1 city-1-loc-7) 24)
  ; 202,280 -> 73,81
  (road city-1-loc-7 city-1-loc-4)
  (= (road-length city-1-loc-7 city-1-loc-4) 24)
  ; 73,81 -> 202,280
  (road city-1-loc-4 city-1-loc-7)
  (= (road-length city-1-loc-4 city-1-loc-7) 24)
  ; 202,280 -> 525,99
  (road city-1-loc-7 city-1-loc-6)
  (= (road-length city-1-loc-7 city-1-loc-6) 37)
  ; 525,99 -> 202,280
  (road city-1-loc-6 city-1-loc-7)
  (= (road-length city-1-loc-6 city-1-loc-7) 37)
  ; 496,792 -> 129,742
  (road city-1-loc-8 city-1-loc-2)
  (= (road-length city-1-loc-8 city-1-loc-2) 37)
  ; 129,742 -> 496,792
  (road city-1-loc-2 city-1-loc-8)
  (= (road-length city-1-loc-2 city-1-loc-8) 37)
  ; 496,792 -> 797,595
  (road city-1-loc-8 city-1-loc-3)
  (= (road-length city-1-loc-8 city-1-loc-3) 36)
  ; 797,595 -> 496,792
  (road city-1-loc-3 city-1-loc-8)
  (= (road-length city-1-loc-3 city-1-loc-8) 36)
  ; 496,792 -> 376,935
  (road city-1-loc-8 city-1-loc-5)
  (= (road-length city-1-loc-8 city-1-loc-5) 19)
  ; 376,935 -> 496,792
  (road city-1-loc-5 city-1-loc-8)
  (= (road-length city-1-loc-5 city-1-loc-8) 19)
  ; 2809,250 -> 2796,415
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 17)
  ; 2796,415 -> 2809,250
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 17)
  ; 2695,475 -> 2796,415
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 12)
  ; 2796,415 -> 2695,475
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 12)
  ; 2695,475 -> 2809,250
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 26)
  ; 2809,250 -> 2695,475
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 26)
  ; 2538,884 -> 2228,851
  (road city-2-loc-6 city-2-loc-4)
  (= (road-length city-2-loc-6 city-2-loc-4) 32)
  ; 2228,851 -> 2538,884
  (road city-2-loc-4 city-2-loc-6)
  (= (road-length city-2-loc-4 city-2-loc-6) 32)
  ; 2398,278 -> 2337,111
  (road city-2-loc-7 city-2-loc-1)
  (= (road-length city-2-loc-7 city-2-loc-1) 18)
  ; 2337,111 -> 2398,278
  (road city-2-loc-1 city-2-loc-7)
  (= (road-length city-2-loc-1 city-2-loc-7) 18)
  ; 2398,278 -> 2796,415
  (road city-2-loc-7 city-2-loc-2)
  (= (road-length city-2-loc-7 city-2-loc-2) 43)
  ; 2796,415 -> 2398,278
  (road city-2-loc-2 city-2-loc-7)
  (= (road-length city-2-loc-2 city-2-loc-7) 43)
  ; 2398,278 -> 2809,250
  (road city-2-loc-7 city-2-loc-3)
  (= (road-length city-2-loc-7 city-2-loc-3) 42)
  ; 2809,250 -> 2398,278
  (road city-2-loc-3 city-2-loc-7)
  (= (road-length city-2-loc-3 city-2-loc-7) 42)
  ; 2398,278 -> 2695,475
  (road city-2-loc-7 city-2-loc-5)
  (= (road-length city-2-loc-7 city-2-loc-5) 36)
  ; 2695,475 -> 2398,278
  (road city-2-loc-5 city-2-loc-7)
  (= (road-length city-2-loc-5 city-2-loc-7) 36)
  ; 2094,563 -> 2228,851
  (road city-2-loc-8 city-2-loc-4)
  (= (road-length city-2-loc-8 city-2-loc-4) 32)
  ; 2228,851 -> 2094,563
  (road city-2-loc-4 city-2-loc-8)
  (= (road-length city-2-loc-4 city-2-loc-8) 32)
  ; 2094,563 -> 2398,278
  (road city-2-loc-8 city-2-loc-7)
  (= (road-length city-2-loc-8 city-2-loc-7) 42)
  ; 2398,278 -> 2094,563
  (road city-2-loc-7 city-2-loc-8)
  (= (road-length city-2-loc-7 city-2-loc-8) 42)
  ; 797,595 <-> 2094,563
  (road city-1-loc-3 city-2-loc-8)
  (= (road-length city-1-loc-3 city-2-loc-8) 130)
  (road city-2-loc-8 city-1-loc-3)
  (= (road-length city-2-loc-8 city-1-loc-3) 130)
  (at package-1 city-1-loc-6)
  (at package-2 city-1-loc-6)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-4)
  (capacity truck-2 capacity-3)
  (at truck-3 city-2-loc-8)
  (capacity truck-3 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-2-loc-8 city-1-loc-3)
   deleted: (at truck-3 city-2-loc-8)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
2. (drive truck-3 city-1-loc-3 city-1-loc-8)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-8)
   goals met: 0 of 2
3. (drive truck-3 city-1-loc-8 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-8)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 2
4. (drive truck-3 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 2
5. (drive truck-3 city-1-loc-1 city-1-loc-7)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-7)
   goals met: 0 of 2
6. (drive truck-3 city-1-loc-7 city-1-loc-6)
   deleted: (at truck-3 city-1-loc-7)
   added: (at truck-3 city-1-loc-6)
   goals met: 0 of 2
7. (pick-up truck-3 city-1-loc-6 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-6) (capacity truck-3 capacity-3)
   added: (in package-2 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 2
8. (pick-up truck-3 city-1-loc-6 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-1-loc-6) (capacity truck-3 capacity-2)
   added: (in package-1 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 2
9. (drive truck-3 city-1-loc-6 city-1-loc-7)
   deleted: (at truck-3 city-1-loc-6)
   added: (at truck-3 city-1-loc-7)
   goals met: 0 of 2
10. (drive truck-3 city-1-loc-7 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-7)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 2
11. (drive truck-3 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 2
12. (drive truck-3 city-1-loc-2 city-1-loc-8)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-8)
   goals met: 0 of 2
13. (drive truck-3 city-1-loc-8 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-8)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
14. (drive truck-3 city-1-loc-3 city-2-loc-8)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-2-loc-8)
   goals met: 0 of 2
15. (drive truck-3 city-2-loc-8 city-2-loc-4)
   deleted: (at truck-3 city-2-loc-8)
   added: (at truck-3 city-2-loc-4)
   goals met: 0 of 2
16. (drop truck-3 city-2-loc-4 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-1)
   added: (at package-1 city-2-loc-4) (capacity truck-3 capacity-2)
   goals met: 1 of 2
17. (drive truck-3 city-2-loc-4 city-2-loc-8)
   deleted: (at truck-3 city-2-loc-4)
   added: (at truck-3 city-2-loc-8)
   goals met: 1 of 2
18. (drive truck-3 city-2-loc-8 city-2-loc-7)
   deleted: (at truck-3 city-2-loc-8)
   added: (at truck-3 city-2-loc-7)
   goals met: 1 of 2
19. (drive truck-3 city-2-loc-7 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-7)
   added: (at truck-3 city-2-loc-2)
   goals met: 1 of 2
20. (drop truck-3 city-2-loc-2 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-2)
   added: (at package-2 city-2-loc-2) (capacity truck-3 capacity-3)
   goals met: 2 of 2
